#+title: Lesson_21032023


* Занятие 21 марта 2023
** Списковые включения
https://www.codecamp.ru/blog/python-list-comprehensions/

#+begin_src python
a = list(range(100))

d = {i: i for i in a if i % 2 == 0}


return d

#+end_src

#+RESULTS:
| 0: | 0 | 2: | 2 | 4: | 4 | 6: | 6 | 8: | 8 | 10: | 10 | 12: | 12 | 14: | 14 | 16: | 16 | 18: | 18 | 20: | 20 | 22: | 22 | 24: | 24 | 26: | 26 | 28: | 28 | 30: | 30 | 32: | 32 | 34: | 34 | 36: | 36 | 38: | 38 | 40: | 40 | 42: | 42 | 44: | 44 | 46: | 46 | 48: | 48 | 50: | 50 | 52: | 52 | 54: | 54 | 56: | 56 | 58: | 58 | 60: | 60 | 62: | 62 | 64: | 64 | 66: | 66 | 68: | 68 | 70: | 70 | 72: | 72 | 74: | 74 | 76: | 76 | 78: | 78 | 80: | 80 | 82: | 82 | 84: | 84 | 86: | 86 | 88: | 88 | 90: | 90 | 92: | 92 | 94: | 94 | 96: | 96 | 98: | 98 |

** Map / Reduce

#+begin_quote
[] [] [] [] [] [] [] [] - информация url -> текст
\------------v---------/

текст => {"абракадабра": "http://abracadabra.com", "Кулибин": "url"}

   ||
   \/

{"абракадабра": ["http://abracadabra.com", "http://url.com"...]}
#+end_quote
https://habr.com/ru/post/103467/


https://docs.python.org/3/library/functools.html
https://realpython.com/python-reduce-function/


https://docs.python.org/3/library/functools.html
https://docs.python.org/3/library/functools.html#functools.reduce
https://docs-python.ru/standart-library/modul-functools-python/funktsija-reduce-modulja-functools/
https://habr.com/ru/post/257903/

** Домашнее задание
*** Что такое iterable в Python?
*** Пролистать документацию по модулю functools
*** Желательно прочитать все статьи (особенно если лень читать документацию)
